package com.algs.recursion;

/**
 * @author zms
 * @date 6:28 下午 2021/10/14
 */
public class Code13Coffee {

    // 数组arr代表每一个咖啡机冲一杯咖啡的时间，每个咖啡机只能串行的制造咖啡。
    // 现在有n个人需要喝咖啡，只能用咖啡机来制造咖啡。
    // 认为每个人喝咖啡的时间非常短，冲好的时间即是喝完的时间。
    // 每个人喝完之后咖啡杯可以选择洗或者自然挥发干净，只有一台洗咖啡杯的机器，只能串行的洗咖啡杯。
    // 洗杯子的机器洗完一个杯子时间为a，任何一个杯子自然挥发干净的时间为b。
    // 四个参数：arr, n, a, b
    // 假设时间点从0开始，返回所有人喝完咖啡并洗完咖啡杯的全部过程结束后，至少来到什么时间点。
    public static int right(int[] arr, int n, int a, int b) {
        return 0;
    }

    // 每个人喝完咖啡的时间

}
