package com.question.day04;


/**
 * <a href="https://leetcode.com/problems/candy/">candy</a>
 *
 * @author wcl
 * @date 7:45 下午 2021/9/19
 */
public class Code05CandyProblem {
    /**
     * 老师想给孩子们分发糖果，有N个孩子站成了一条直线，老师会根据每个孩子的表现，预先给他们评分。
     * 你需要按照以下要求，帮助老师给这些孩子分发糖果：
     * 1、每个孩子至少分配到 1 个糖果。
     * 2、评分更高的孩子必须比他两侧的邻位孩子获得更多的糖果。
     * 那么这样下来，老师至少需要准备多少颗糖果呢？
     * <p>
     * 示例1：
     * 输入：[1,0,2]
     * 输出：5
     * 解释：你可以分别给这三个孩子分发 2、1、2 颗糖果。
     * <p>
     * 示例2：
     * 输入：[1,2,2]
     * 输出：4
     * 解释：你可以分别给这三个孩子分发 1、2、1 颗糖果。
     * 第三个孩子只得到 1 颗糖果，这已满足上述两个条件。
     */
    public int candy(int[] ratings) {
        return 0;
    }

    // 补充条件：相邻两个孩子的分数相同，则这两个孩子获得的糖果必须相同
}
